"""
3. Визначити, чи є задане натуральне число паліндромом, тобто таким, десяткова запис якого
читається однаково зліва направо і справа наліво.
Скорий Євген 141
"""

def check(a):
    res = 0
    while(a!=0):
        digit = a % 10
        res = res * 10 + digit
        a=int(a / 10)
    return res

print("Перевірка числа на поліндром")
n = int(input("Введіть число = "))

if(check(n) == n):
    print("Число ", n, " є поліндромом")
else:
    print("Число ", n, " не є поліндромом")
