"""
13. Дано ціле число N (> 0). Знайти квадрат даного числа, використовуючи для його обчислення
наступну формулу: N = 1 + 3 + 5 + ... + (2 • N - 1).
Після додавання до суми кожного доданка виводити поточне значення суми (в результаті будуть
виведені квадрати всіх цілих чисел від 1 до N).
Скорий Євген 141
"""

n = int(input("Введіть число N(N > 0): "))
sum = 0

if n < 0:
    print("Помилка: число повинно бути більше 0")
    exit()
else:
    print("Квадрати числа ", n )
    for i in range(n):
        sum += 2 * i + 1
        print(sum)